ThisIsNotRocketScience/Syntonovo_PAN/controller/usbmidiio/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitPins(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t LD1BLANK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 100)  */
    GPIO_PinInit(BOARD_INITPINS_LD1BLANK_GPIO, BOARD_INITPINS_LD1BLANK_PORT, BOARD_INITPINS_LD1BLANK_PIN, &LD1BLANK_config);

    gpio_pin_config_t LD1DATA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_3 (pin 85)  */
    GPIO_PinInit(BOARD_INITPINS_LD1DATA_GPIO, BOARD_INITPINS_LD1DATA_PORT, BOARD_INITPINS_LD1DATA_PIN, &LD1DATA_config);

    gpio_pin_config_t LD2BLANK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin 89)  */
    GPIO_PinInit(BOARD_INITPINS_LD2BLANK_GPIO, BOARD_INITPINS_LD2BLANK_PORT, BOARD_INITPINS_LD2BLANK_PIN, &LD2BLANK_config);

    gpio_pin_config_t LD1CLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_LD1CLK_GPIO, BOARD_INITPINS_LD1CLK_PORT, BOARD_INITPINS_LD1CLK_PIN, &LD1CLK_config);

    gpio_pin_config_t SW1CLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_SW1CLK_GPIO, BOARD_INITPINS_SW1CLK_PORT, BOARD_INITPINS_SW1CLK_PIN, &SW1CLK_config);

    gpio_pin_config_t T3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_T3_GPIO, BOARD_INITPINS_T3_PORT, BOARD_INITPINS_T3_PIN, &T3_config);

    gpio_pin_config_t SW1DATA_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin 65)  */
    GPIO_PinInit(BOARD_INITPINS_SW1DATA_GPIO, BOARD_INITPINS_SW1DATA_PORT, BOARD_INITPINS_SW1DATA_PIN, &SW1DATA_config);

    gpio_pin_config_t MK2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 67)  */
    GPIO_PinInit(BOARD_INITPINS_MK2_GPIO, BOARD_INITPINS_MK2_PORT, BOARD_INITPINS_MK2_PIN, &MK2_config);

    gpio_pin_config_t BR2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_BR2_GPIO, BOARD_INITPINS_BR2_PORT, BOARD_INITPINS_BR2_PIN, &BR2_config);

    gpio_pin_config_t LD1XLAT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin 26)  */
    GPIO_PinInit(BOARD_INITPINS_LD1XLAT_GPIO, BOARD_INITPINS_LD1XLAT_PORT, BOARD_INITPINS_LD1XLAT_PIN, &LD1XLAT_config);

    gpio_pin_config_t gpio0_pin27_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 27)  */
    GPIO_PinInit(GPIO, 0U, 16U, &gpio0_pin27_config);

    gpio_pin_config_t T5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_T5_GPIO, BOARD_INITPINS_T5_PORT, BOARD_INITPINS_T5_PIN, &T5_config);

    gpio_pin_config_t MK3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 72)  */
    GPIO_PinInit(BOARD_INITPINS_MK3_GPIO, BOARD_INITPINS_MK3_PORT, BOARD_INITPINS_MK3_PIN, &MK3_config);

    gpio_pin_config_t SW1LATCH_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 91)  */
    GPIO_PinInit(BOARD_INITPINS_SW1LATCH_GPIO, BOARD_INITPINS_SW1LATCH_PORT, BOARD_INITPINS_SW1LATCH_PIN, &SW1LATCH_config);

    gpio_pin_config_t BR3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 74)  */
    GPIO_PinInit(BOARD_INITPINS_BR3_GPIO, BOARD_INITPINS_BR3_PORT, BOARD_INITPINS_BR3_PIN, &BR3_config);

    gpio_pin_config_t T7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_T7_GPIO, BOARD_INITPINS_T7_PORT, BOARD_INITPINS_T7_PIN, &T7_config);

    gpio_pin_config_t BR4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 80)  */
    GPIO_PinInit(BOARD_INITPINS_BR4_GPIO, BOARD_INITPINS_BR4_PORT, BOARD_INITPINS_BR4_PIN, &BR4_config);

    gpio_pin_config_t RASPI_DETECT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 60)  */
    GPIO_PinInit(BOARD_INITPINS_RASPI_DETECT_GPIO, BOARD_INITPINS_RASPI_DETECT_PORT, BOARD_INITPINS_RASPI_DETECT_PIN, &RASPI_DETECT_config);

    gpio_pin_config_t MK0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_8 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_MK0_GPIO, BOARD_INITPINS_MK0_PORT, BOARD_INITPINS_MK0_PIN, &MK0_config);

    gpio_pin_config_t BR0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 39)  */
    GPIO_PinInit(BOARD_INITPINS_BR0_GPIO, BOARD_INITPINS_BR0_PORT, BOARD_INITPINS_BR0_PIN, &BR0_config);

