ThisIsNotRocketScience/Syntonovo_PAN/controller/usbmidiio/board/pin_mux.c
    gpio_pin_config_t SW2LATCH_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin 94)  */
    GPIO_PinInit(BOARD_INITPINS_SW2LATCH_GPIO, BOARD_INITPINS_SW2LATCH_PORT, BOARD_INITPINS_SW2LATCH_PIN, &SW2LATCH_config);

    gpio_pin_config_t LD2CLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_12 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_LD2CLK_GPIO, BOARD_INITPINS_LD2CLK_PORT, BOARD_INITPINS_LD2CLK_PIN, &LD2CLK_config);

    gpio_pin_config_t LD2DATA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin 66)  */
    GPIO_PinInit(BOARD_INITPINS_LD2DATA_GPIO, BOARD_INITPINS_LD2DATA_PORT, BOARD_INITPINS_LD2DATA_PIN, &LD2DATA_config);

    gpio_pin_config_t MK4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin 78)  */
    GPIO_PinInit(BOARD_INITPINS_MK4_GPIO, BOARD_INITPINS_MK4_PORT, BOARD_INITPINS_MK4_PIN, &MK4_config);

    gpio_pin_config_t T2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin 47)  */
    GPIO_PinInit(BOARD_INITPINS_T2_GPIO, BOARD_INITPINS_T2_PORT, BOARD_INITPINS_T2_PIN, &T2_config);

    gpio_pin_config_t SW2CLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_SW2CLK_GPIO, BOARD_INITPINS_SW2CLK_PORT, BOARD_INITPINS_SW2CLK_PIN, &SW2CLK_config);

    gpio_pin_config_t SW2DATA_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_20 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_SW2DATA_GPIO, BOARD_INITPINS_SW2DATA_PORT, BOARD_INITPINS_SW2DATA_PIN, &SW2DATA_config);

    gpio_pin_config_t T0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_21 (pin 37)  */
    GPIO_PinInit(BOARD_INITPINS_T0_GPIO, BOARD_INITPINS_T0_PORT, BOARD_INITPINS_T0_PIN, &T0_config);

    gpio_pin_config_t T1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_T1_GPIO, BOARD_INITPINS_T1_PORT, BOARD_INITPINS_T1_PIN, &T1_config);

    gpio_pin_config_t MK1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_MK1_GPIO, BOARD_INITPINS_MK1_PORT, BOARD_INITPINS_MK1_PIN, &MK1_config);

    gpio_pin_config_t BR1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 63)  */
    GPIO_PinInit(BOARD_INITPINS_BR1_GPIO, BOARD_INITPINS_BR1_PORT, BOARD_INITPINS_BR1_PIN, &BR1_config);

    gpio_pin_config_t T4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_27 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_T4_GPIO, BOARD_INITPINS_T4_PORT, BOARD_INITPINS_T4_PIN, &T4_config);

    gpio_pin_config_t T6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_28 (pin 73)  */
    GPIO_PinInit(BOARD_INITPINS_T6_GPIO, BOARD_INITPINS_T6_PORT, BOARD_INITPINS_T6_PIN, &T6_config);

    gpio_pin_config_t LD2XLAT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_31 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_LD2XLAT_GPIO, BOARD_INITPINS_LD2XLAT_PORT, BOARD_INITPINS_LD2XLAT_PIN, &LD2XLAT_config);

    IOCON->PIO[0][1] = ((IOCON->PIO[0][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT01 (pin 100) is configured as PIO0_1. */
                        | IOCON_PIO_FUNC(PIO01_FUNC_ALT0)

                        /* Select Analog/Digital mode.
                         * : Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO01_DIGIMODE_DIGITAL));

    IOCON->PIO[0][13] = ((IOCON->PIO[0][13] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT013 (pin 67) is configured as PIO0_13. */
                         | IOCON_PIO_FUNC(PIO013_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO013_DIGIMODE_DIGITAL));

    IOCON->PIO[0][14] = ((IOCON->PIO[0][14] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT014 (pin 69) is configured as PIO0_14. */
                         | IOCON_PIO_FUNC(PIO014_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO014_DIGIMODE_DIGITAL));

    IOCON->PIO[0][15] = ((IOCON->PIO[0][15] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT015 (pin 26) is configured as PIO0_15. */
                         | IOCON_PIO_FUNC(PIO015_FUNC_ALT0)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO015_DIGIMODE_DIGITAL));

